In [1]:
import numpy as np
import pandas as pd

In [3]:
#Object creation
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101',periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.032980 -0.018772  0.030201  0.290348
2013-01-02  0.983452 -0.725471 -0.872578  1.585969
2013-01-03 -0.420765  0.394701 -0.106128 -0.683597
2013-01-04  0.783404 -0.231234  0.580202 -1.769004
2013-01-05 -0.395083 -2.548501 -0.564199  0.418166
2013-01-06 -1.136064  0.191619 -0.150682  0.306557

In [8]:
df2 = pd.DataFrame({
    'A':1.,
    'B':pd.Timestamp('20130102'),
    'C':pd.Series(1,index=list(range(4)),dtype='float32'),
    'D':np.array([3]*4,dtype='int32'),
    'E':pd.Categorical(["test","train","test","train"]),
    'F':'foo'
})

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
# The Columns of the resulting DataFrame have differnt dtypes.
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [10]:
#If youre usint Ipython, tab completion for column names ( as well as public attribute ) is automatically enabled. Here
# a subset of the attribute that will be completed:
df2.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [11]:
df2.abs

<bound method NDFrame.abs of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [12]:
df2.add

<bound method _arith_method_FRAME.<locals>.f of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [13]:
df2.bool

<bound method NDFrame.bool of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [14]:
df2.boxplot

<bound method boxplot_frame of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [15]:
df2.C

0    1.0
1    1.0
2    1.0
3    1.0
Name: C, dtype: float32

In [16]:
df2.add_prefix

<bound method NDFrame.add_prefix of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [17]:
df2.add_suffix

<bound method NDFrame.add_suffix of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [18]:
df2.align

<bound method DataFrame.align of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [19]:
#Viewing Data
df.head()

                   A         B         C         D
2013-01-01 -1.032980 -0.018772  0.030201  0.290348
2013-01-02  0.983452 -0.725471 -0.872578  1.585969
2013-01-03 -0.420765  0.394701 -0.106128 -0.683597
2013-01-04  0.783404 -0.231234  0.580202 -1.769004
2013-01-05 -0.395083 -2.548501 -0.564199  0.418166

In [21]:
df.tail(2)

                   A         B         C         D
2013-01-05 -0.395083 -2.548501 -0.564199  0.418166
2013-01-06 -1.136064  0.191619 -0.150682  0.306557

In [22]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [23]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [24]:
df.to_numpy()

array([[-1.03297965, -0.01877198,  0.03020055,  0.29034788],
       [ 0.98345162, -0.72547076, -0.87257782,  1.58596937],
       [-0.42076478,  0.39470129, -0.10612757, -0.68359662],
       [ 0.78340447, -0.2312344 ,  0.58020177, -1.76900367],
       [-0.39508334, -2.54850119, -0.56419865,  0.41816628],
       [-1.13606401,  0.19161877, -0.15068172,  0.30655725]])

In [25]:
#DataFrame.to_numpy() does not include the index or column labels in the output.
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [26]:
#describe() shows a quick statistic summary of your data:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.203006 -0.489610 -0.180531  0.024740
std    0.897157  1.079740  0.501134  1.136789
min   -1.136064 -2.548501 -0.872578 -1.769004
25%   -0.879926 -0.601912 -0.460819 -0.440110
50%   -0.407924 -0.125003 -0.128405  0.298453
75%    0.488783  0.139021 -0.003881  0.390264
max    0.983452  0.394701  0.580202  1.585969

In [27]:
#Transposint your data:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.032980    0.983452   -0.420765    0.783404   -0.395083   -1.136064
B   -0.018772   -0.725471    0.394701   -0.231234   -2.548501    0.191619
C    0.030201   -0.872578   -0.106128    0.580202   -0.564199   -0.150682
D    0.290348    1.585969   -0.683597   -1.769004    0.418166    0.306557

In [28]:
#Sorting by an axis:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01  0.290348  0.030201 -0.018772 -1.032980
2013-01-02  1.585969 -0.872578 -0.725471  0.983452
2013-01-03 -0.683597 -0.106128  0.394701 -0.420765
2013-01-04 -1.769004  0.580202 -0.231234  0.783404
2013-01-05  0.418166 -0.564199 -2.548501 -0.395083
2013-01-06  0.306557 -0.150682  0.191619 -1.136064

In [31]:
# Sorting by values:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05 -0.395083 -2.548501 -0.564199  0.418166
2013-01-02  0.983452 -0.725471 -0.872578  1.585969
2013-01-04  0.783404 -0.231234  0.580202 -1.769004
2013-01-01 -1.032980 -0.018772  0.030201  0.290348
2013-01-06 -1.136064  0.191619 -0.150682  0.306557
2013-01-03 -0.420765  0.394701 -0.106128 -0.683597

In [32]:
# Selecting a single column, which yields a Series, equivalent to df.A
df['A']

2013-01-01   -1.032980
2013-01-02    0.983452
2013-01-03   -0.420765
2013-01-04    0.783404
2013-01-05   -0.395083
2013-01-06   -1.136064
Freq: D, Name: A, dtype: float64

In [36]:
df[1:4]

                   A         B         C         D
2013-01-02  0.983452 -0.725471 -0.872578  1.585969
2013-01-03 -0.420765  0.394701 -0.106128 -0.683597
2013-01-04  0.783404 -0.231234  0.580202 -1.769004

In [37]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.983452 -0.725471 -0.872578  1.585969
2013-01-03 -0.420765  0.394701 -0.106128 -0.683597
2013-01-04  0.783404 -0.231234  0.580202 -1.769004

In [39]:
#Selection by label
# For getting a cross section using a label:
df.loc[dates[0]]

A   -1.032980
B   -0.018772
C    0.030201
D    0.290348
Name: 2013-01-01 00:00:00, dtype: float64

In [40]:
# Selecting on a multi-axis by label:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.032980 -0.018772
2013-01-02  0.983452 -0.725471
2013-01-03 -0.420765  0.394701
2013-01-04  0.783404 -0.231234
2013-01-05 -0.395083 -2.548501
2013-01-06 -1.136064  0.191619

In [41]:
#Showing label slicing, both endpoints are include:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.983452 -0.725471
2013-01-03 -0.420765  0.394701
2013-01-04  0.783404 -0.231234

In [42]:
# Reduction in the dimensions of the returned object:
df.loc['20130102',['A','B']]

A    0.983452
B   -0.725471
Name: 2013-01-02 00:00:00, dtype: float64

In [43]:
#For getting a scalar value:
df.loc[dates[0],'A']

-1.0329796465733114

In [44]:
#Selection by position
#See more in Selection by Position.
# Select via the position of the passed integers:
df.iloc[3]

A    0.783404
B   -0.231234
C    0.580202
D   -1.769004
Name: 2013-01-04 00:00:00, dtype: float64

In [45]:
#By integer slices, acting similar to numpy/python:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.783404 -0.231234
2013-01-05 -0.395083 -2.548501

In [46]:
# By integer slices, acting similar to numpy/python:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.783404 -0.231234
2013-01-05 -0.395083 -2.548501

In [47]:
#By lists of integer position locations, similar to the numpy/python style:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.983452 -0.872578
2013-01-03 -0.420765 -0.106128
2013-01-05 -0.395083 -0.564199

In [48]:
#for slicing rows explicitly:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.983452 -0.725471 -0.872578  1.585969
2013-01-03 -0.420765  0.394701 -0.106128 -0.683597

In [49]:
#for slicing columns explicty
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.018772  0.030201
2013-01-02 -0.725471 -0.872578
2013-01-03  0.394701 -0.106128
2013-01-04 -0.231234  0.580202
2013-01-05 -2.548501 -0.564199
2013-01-06  0.191619 -0.150682

In [50]:
#For getting a value explicity:
df.iloc[1,1]

-0.7254707620449721

In [51]:
#For getting fast access to a scalar ( equivalent to prior method ):
df.iat[1,1]

-0.7254707620449721

In [52]:
df[df.A>0]

                   A         B         C         D
2013-01-02  0.983452 -0.725471 -0.872578  1.585969
2013-01-04  0.783404 -0.231234  0.580202 -1.769004

In [53]:
df2 = df.copy()
df2['E'] = ['one','one','two','three','four','three']

df2

                   A         B         C         D      E
2013-01-01 -1.032980 -0.018772  0.030201  0.290348    one
2013-01-02  0.983452 -0.725471 -0.872578  1.585969    one
2013-01-03 -0.420765  0.394701 -0.106128 -0.683597    two
2013-01-04  0.783404 -0.231234  0.580202 -1.769004  three
2013-01-05 -0.395083 -2.548501 -0.564199  0.418166   four
2013-01-06 -1.136064  0.191619 -0.150682  0.306557  three

In [55]:
df2['E'] = ['one','one','two','three','four','therr']
df2

                   A         B         C         D      E
2013-01-01 -1.032980 -0.018772  0.030201  0.290348    one
2013-01-02  0.983452 -0.725471 -0.872578  1.585969    one
2013-01-03 -0.420765  0.394701 -0.106128 -0.683597    two
2013-01-04  0.783404 -0.231234  0.580202 -1.769004  three
2013-01-05 -0.395083 -2.548501 -0.564199  0.418166   four
2013-01-06 -1.136064  0.191619 -0.150682  0.306557  therr

In [57]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.420765  0.394701 -0.106128 -0.683597   two
2013-01-05 -0.395083 -2.548501 -0.564199  0.418166  four

In [58]:
df2

                   A         B         C         D      E
2013-01-01 -1.032980 -0.018772  0.030201  0.290348    one
2013-01-02  0.983452 -0.725471 -0.872578  1.585969    one
2013-01-03 -0.420765  0.394701 -0.106128 -0.683597    two
2013-01-04  0.783404 -0.231234  0.580202 -1.769004  three
2013-01-05 -0.395083 -2.548501 -0.564199  0.418166   four
2013-01-06 -1.136064  0.191619 -0.150682  0.306557  therr

In [59]:
sl = pd.Series([1,2,3,4,5,6],index=pd.date_range('20130102',periods=6))
sl

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [60]:
df['F'] = sl

In [61]:
df.at[dates[0],'A'] = 0

In [62]:
df.iat[0,1] = 0

In [63]:
df.loc[:,'D'] = np.array([5]*len(df))

In [64]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.030201  5  NaN
2013-01-02  0.983452 -0.725471 -0.872578  5  1.0
2013-01-03 -0.420765  0.394701 -0.106128  5  2.0
2013-01-04  0.783404 -0.231234  0.580202  5  3.0
2013-01-05 -0.395083 -2.548501 -0.564199  5  4.0
2013-01-06 -1.136064  0.191619 -0.150682  5  5.0

In [65]:
#A where operation with setting.
df2 = df.copy()
df2[df2>0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.030201 -5  NaN
2013-01-02 -0.983452 -0.725471 -0.872578 -5 -1.0
2013-01-03 -0.420765 -0.394701 -0.106128 -5 -2.0
2013-01-04 -0.783404 -0.231234 -0.580202 -5 -3.0
2013-01-05 -0.395083 -2.548501 -0.564199 -5 -4.0
2013-01-06 -1.136064 -0.191619 -0.150682 -5 -5.0